WhiteBalance2800K/esp32ai/firmware/src/main.cpp
bool readBtcExact(WiFiClient *stream, uint8_t *dst, size_t length, unsigned long timeoutMs) {
  size_t received = 0;
  unsigned long deadline = millis() + timeoutMs;
  while (received < length) {
    int available = stream->available();
    if (available > 0) {
      size_t want = min((size_t)available, length - received);
      int got = stream->read(dst + received, want);
      if (got > 0) {
        received += (size_t)got;
        continue;
      }
    }
    if ((long)(millis() - deadline) >= 0) return false;
    delay(1);
    yield();
  }
  return true;
}

bool pollBtcRawFrame(uint64_t expectedVersion) {
  if (WiFi.status() != WL_CONNECTED || bridgeHost.length() == 0) return false;
  WiFiClient client;
  client.setTimeout(BTC_FRAME_READ_TIMEOUT_MS);
  HTTPClient http;
  String url = "http://" + bridgeHost + "/btc/frame.raw";
  http.setTimeout(BTC_FRAME_HTTP_TIMEOUT_MS);
  if (!http.begin(client, url)) return false;
  int code = http.GET();
  const int expectedSize = (int)(BTC_FRAME_HEADER_BYTES + SCREEN_W * SCREEN_H * 2);
  if (code != HTTP_CODE_OK || http.getSize() != expectedSize) {
    Serial.printf("[btc] frame GET -> %d size=%d expected=%d\n", code, http.getSize(), expectedSize);
    http.end();
    return false;
  }

  WiFiClient *stream = http.getStreamPtr();
  uint8_t header[BTC_FRAME_HEADER_BYTES];
  if (!readBtcExact(stream, header, sizeof(header), BTC_FRAME_READ_TIMEOUT_MS)) {
    Serial.println("[btc] frame version header timeout");
    http.end();
    return false;
  }
  uint64_t version = 0;
  for (size_t i = 0; i < sizeof(header); i++) version = (version << 8) | header[i];
  // A refresh can land between /version and /frame.raw. A newer frame is
  // valid; rejecting it used to add another full polling interval.
  if (version < expectedVersion || version <= lastBtcFrameVersion) {
    Serial.printf("[btc] skip frame version=%llu expected=%llu last=%llu\n",
                  (unsigned long long)version, (unsigned long long)expectedVersion,
                  (unsigned long long)lastBtcFrameVersion);
    http.end();
    return false;
  }

  const size_t rowBytes = (size_t)SCREEN_W * 2;
  unsigned long frameDeadline = millis() + BTC_FRAME_TOTAL_TIMEOUT_MS;
  bool ok = true;
  for (int y = 0; y < SCREEN_H; y += BTC_FRAME_CHUNK_ROWS) {
    int rows = min(BTC_FRAME_CHUNK_ROWS, SCREEN_H - y);
    size_t bytes = (size_t)rows * rowBytes;
    long remaining = (long)(frameDeadline - millis());
    if (remaining <= 0 ||
        !readBtcExact(stream, (uint8_t *)btcChunkPixels, bytes,
                      min((unsigned long)remaining, BTC_FRAME_READ_TIMEOUT_MS))) {
      Serial.printf("[btc] frame chunk timeout at row %d\n", y);
      ok = false;
      break;
    }
    // Four rows per push reduces SPI command overhead from 240 transactions
    // to 60 while preserving the panel's RGB565 byte order.
    tft.pushImage(0, y, SCREEN_W, rows, btcChunkPixels);
    yield();
  }
  http.end();
  if (ok) {
    lastBtcFrameVersion = version;
    Serial.printf("[btc] frame applied version=%llu\n", (unsigned long long)version);
  }
  return ok;
}

#if defined(CONFIG_IDF_TARGET_ESP32C3)
enum BtcPackedResult { BTC_PACKED_OK, BTC_PACKED_UNAVAILABLE, BTC_PACKED_FAILED };

uint32_t marketCrc32(const uint8_t *data, size_t length) {
  uint32_t crc = 0xFFFFFFFF;
  for (size_t i = 0; i < length; ++i) {
    crc ^= data[i];
    for (int bit = 0; bit < 8; ++bit) {
      crc = (crc >> 1) ^ ((crc & 1U) ? 0xEDB88320U : 0U);
    }
  }
  return ~crc;
}

uint64_t marketReadU64BE(const uint8_t *data) {
  uint64_t value = 0;
  for (int i = 0; i < 8; ++i) value = (value << 8) | data[i];
  return value;
}

uint32_t marketReadU32BE(const uint8_t *data) {
  return ((uint32_t)data[0] << 24) | ((uint32_t)data[1] << 16) |
         ((uint32_t)data[2] << 8) | data[3];
}

// Validate the complete PackBits payload before touching the TFT. This is the
// atomicity boundary: a short read, corrupt run or wrong pixel count leaves
// the previous market screen completely intact.
bool validateBtcPackedFrame(size_t frameBytes, uint64_t expectedVersion,
                            uint64_t &versionOut) {
  if (frameBytes < BTC_PACKED_HEADER_BYTES ||
      memcmp(btcPackedFrame, "MKT1", 4) != 0) return false;
  const uint16_t width = ((uint16_t)btcPackedFrame[12] << 8) | btcPackedFrame[13];
  const uint16_t height = ((uint16_t)btcPackedFrame[14] << 8) | btcPackedFrame[15];
  if (width != SCREEN_W || height != SCREEN_H) return false;

  const uint64_t version = marketReadU64BE(btcPackedFrame + 4);
  if (version < expectedVersion || version <= lastBtcFrameVersion) return false;
  const uint8_t *payload = btcPackedFrame + BTC_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - BTC_PACKED_HEADER_BYTES;
  if (marketCrc32(payload, payloadBytes) != marketReadU32BE(btcPackedFrame + 16)) return false;

  size_t cursor = 0;
  size_t pixels = 0;
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    const size_t count = (control & 0x7F) + 1;
    const size_t encodedBytes = (control & 0x80) ? 2 : count * 2;
    if (cursor + encodedBytes > payloadBytes || pixels + count > SCREEN_W * SCREEN_H) return false;
    cursor += encodedBytes;
    pixels += count;
  }
  if (cursor != payloadBytes || pixels != SCREEN_W * SCREEN_H) return false;
  versionOut = version;
  return true;
}

void drawBtcPackedFrame(size_t frameBytes) {
  const uint8_t *payload = btcPackedFrame + BTC_PACKED_HEADER_BYTES;
  const size_t payloadBytes = frameBytes - BTC_PACKED_HEADER_BYTES;
  uint8_t *chunkBytes = reinterpret_cast<uint8_t *>(btcChunkPixels);
  const size_t chunkCapacity = SCREEN_W * BTC_FRAME_CHUNK_ROWS;
  size_t chunkPixels = 0;
  size_t cursor = 0;
  int drawY = 0;

  tft.startWrite();
  while (cursor < payloadBytes) {
    const uint8_t control = payload[cursor++];
    const size_t count = (control & 0x7F) + 1;
    if (control & 0x80) {
      const uint8_t high = payload[cursor++];
      const uint8_t low = payload[cursor++];
      for (size_t i = 0; i < count; ++i) {
        // Preserve the existing RGB565 wire byte order. The C3 is little
        // endian and this firmware intentionally leaves setSwapBytes off.
        chunkBytes[chunkPixels * 2] = high;
        chunkBytes[chunkPixels * 2 + 1] = low;
        if (++chunkPixels == chunkCapacity) {
          tft.pushImage(0, drawY, SCREEN_W, BTC_FRAME_CHUNK_ROWS, btcChunkPixels);
          drawY += BTC_FRAME_CHUNK_ROWS;
          chunkPixels = 0;
        }
      }
    } else {
      for (size_t i = 0; i < count; ++i) {
        chunkBytes[chunkPixels * 2] = payload[cursor++];
        chunkBytes[chunkPixels * 2 + 1] = payload[cursor++];
        if (++chunkPixels == chunkCapacity) {
          tft.pushImage(0, drawY, SCREEN_W, BTC_FRAME_CHUNK_ROWS, btcChunkPixels);
          drawY += BTC_FRAME_CHUNK_ROWS;
          chunkPixels = 0;
        }
      }
    }
  }
  tft.endWrite();
}

